MoseychukA/FLARM_ALL/ChatGPT_FlyRF/ESP32_Base/FlyRf_Base_26_04_22_12/WebRF.cpp
/*
  Модуль WebRF.cpp
  Назначение:
  - WEB-интерфейс настройки и обслуживания устройства.

  Основные задачи модуля:
  - Поднимать HTTP-сервер и формировать HTML-страницы конфигуратора.
  - Показывать текущие параметры работы устройства и служебную диагностику.
  - Принимать изменения настроек, применять их в runtime и сохранять в EEPROM.
  - Выполнять сервисные действия: перезагрузка, обновление, изменение режимов и параметров вывода.
*/

#include "WebRF.h"
#include <WebServer.h>
#include <Update.h>
#include <math.h>
#include <TimeLib.h>
#include "WiFiRF.h"
#include "EEPROMRF.h"
#include "RP2040Bridge.h"
#include "TrafficDB.h"
#include "Log.h"
#include "NMEA.h"
#include "DeviceInfo.h"
#include "RF.h"
#include "ESP32RF.h"
#include "GNSS.h"
#include "Baro.h"
#include "Bluetooth.h"
#include <freqplan.h>


String TxDataTemplate;  //
static WebServer server(80);
static bool g_rebootPending = false;  //
static uint32_t g_rebootAtMs = 0;  
static bool g_updateOk = false;  //
static String g_updateMessage;  
static bool g_otaInProgress = false;  //
static uint32_t g_otaWritten = 0;  
static uint32_t g_otaTotal = 0;  

//------------------------------------------------------------------------------
// Назначение функции: Выполняет логику функции `scheduleReboot` и обрабатывает schedule reboot в контексте модуля WebRF.cpp.
//------------------------------------------------------------------------------
static void scheduleReboot(uint32_t delayMs = 1500)
{
    g_rebootPending = true;
    g_rebootAtMs = millis() + delayMs;
}

//------------------------------------------------------------------------------
// Назначение функции: Формирует и отправляет no cache через нужный интерфейс связи или вывода.
//------------------------------------------------------------------------------
static void sendNoCache()
{
    server.sendHeader("Cache-Control", "no-cache, no-store, must-revalidate");
    server.sendHeader("Pragma", "no-cache");
    server.sendHeader("Expires", "-1");
}

//------------------------------------------------------------------------------
// Назначение функции: Выполняет логику функции `clampInt` и обрабатывает clamp int в контексте модуля WebRF.cpp.
//------------------------------------------------------------------------------
static int clampInt(int v, int lo, int hi)
{
    if (v < lo) return lo;
    if (v > hi) return hi;
    return v;
}

//------------------------------------------------------------------------------
// Назначение функции: Выполняет логику функции `sel` и обрабатывает sel в контексте модуля WebRF.cpp.
//------------------------------------------------------------------------------
static const char* sel(bool cond) { return cond ? "selected" : ""; }
//------------------------------------------------------------------------------
// Назначение функции: Выполняет логику функции `chk` и обрабатывает chk в контексте модуля WebRF.cpp.
//------------------------------------------------------------------------------
static const char* chk(bool cond) { return cond ? "checked" : ""; }


//------------------------------------------------------------------------------
// Назначение функции: Выполняет логику функции `clampAlarmAttention` и обрабатывает clamp порог тревоги attention в контексте модуля WebRF.cpp.
//------------------------------------------------------------------------------
static int clampAlarmAttention(int v) { return clampInt(v, 2000, 3000); }
//------------------------------------------------------------------------------
// Назначение функции: Выполняет логику функции `clampAlarmWarning` и обрабатывает clamp порог тревоги warning в контексте модуля WebRF.cpp.
//------------------------------------------------------------------------------
static int clampAlarmWarning(int v)   { return clampInt(v,  200, 2000); }
//------------------------------------------------------------------------------
// Назначение функции: Выполняет логику функции `clampAlarmDanger` и обрабатывает clamp порог тревоги danger в контексте модуля WebRF.cpp.
//------------------------------------------------------------------------------
static int clampAlarmDanger(int v)    { return clampInt(v,   10,  500); }
//------------------------------------------------------------------------------
// Назначение функции: Выполняет логику функции `clampAlarmHeight` и обрабатывает clamp порог тревоги height в контексте модуля WebRF.cpp.
//
//------------------------------------------------------------------------------
static int clampAlarmHeight(int v)    { return clampInt(v,   30,  300); }

//------------------------------------------------------------------------------
// Назначение функции: Выполняет логику функции `ipToString` и обрабатывает IP-адрес string в контексте модуля WebRF.cpp.
//------------------------------------------------------------------------------
static String ipToString(const uint8_t ip[4])
{
    if (ip == nullptr) return String("0.0.0.0");
    return String(ip[0]) + "." + String(ip[1]) + "." + String(ip[2]) + "." + String(ip[3]);
}

//------------------------------------------------------------------------------
// Назначение функции: Выполняет логику функции `ipToString` и обрабатывает IP-адрес string в контексте модуля WebRF.cpp.
//------------------------------------------------------------------------------
static String ipToString(const IPAddress& ip)
{
    return String(ip[0]) + "." + String(ip[1]) + "." + String(ip[2]) + "." + String(ip[3]);
}

//------------------------------------------------------------------------------
// Назначение функции: Формирует utc now текст в готовом виде для вывода, передачи или последующей обработки.
// Локальные переменные: t — рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла; 
// buf — текстовая строка или буфер: хранит входное сообщение, сформированный ответ либо промежуточный текст.
// - buf: Буфер, текстовая строка или рабочее сообщение.
//------------------------------------------------------------------------------
static String formatUtcNowText()
{
    if (!GNSS_timeValid()) return String("&#1085;&#1077;&#1090;");

    const time_t t = now();
    char buf[32];  // Текстовая строка или буфер: хранит входное сообщение, сформированный ответ либо промежуточный текст.
    snprintf(buf, sizeof(buf), "%02d.%02d.%04d %02d:%02d:%02d",
             day(t), month(t), year(t), hour(t), minute(t), second(t));
    return String(buf);
}

//------------------------------------------------------------------------------
// Назначение функции: Формирует данные GNSS coordinate текст в готовом виде для вывода, передачи или последующей обработки.
//------------------------------------------------------------------------------
static String formatGnssCoordinateText()
{
    if (!GNSS_coordinatesValid()) return String("&#1085;&#1077;&#1090;");
    return String(GNSS_latitude(), 5) + ", " + String(GNSS_longitude(), 5);
}

//------------------------------------------------------------------------------
// Назначение функции: Формирует altitude текст в готовом виде для вывода, передачи или последующей обработки.
// Локальные переменные: buf — текстовая строка или буфер: хранит входное сообщение, сформированный ответ либо промежуточный текст.
// - buf: Буфер, текстовая строка или рабочее сообщение.
//------------------------------------------------------------------------------
static String formatAltitudeText()
{
    char buf[48];  // Текстовая строка или буфер: хранит входное сообщение, сформированный ответ либо промежуточный текст.
    if (Baro_available())
    {
        snprintf(buf, sizeof(buf), "%.1f m (BMP180)", Baro_altitudeMeters());
        return String(buf);
    }
    if (GNSS_altitudeValid())
    {
        snprintf(buf, sizeof(buf), "%.1f m (GNSS)", GNSS_altitudeMeters());
        return String(buf);
    }
    return String("&#1085;&#1077;&#1090;");
}

//------------------------------------------------------------------------------
// Назначение функции: Формирует gps altitude текст в готовом виде для вывода, передачи или последующей обработки.
// Локальные переменные: buf — текстовая строка или буфер: хранит входное сообщение, сформированный ответ либо промежуточный текст.
// - buf: Буфер, текстовая строка или рабочее сообщение.
//------------------------------------------------------------------------------
static String formatGpsAltitudeText()
{
    char buf[32];  // Текстовая строка или буфер: хранит входное сообщение, сформированный ответ либо промежуточный текст.
    if (GNSS_altitudeValid())
    {
        snprintf(buf, sizeof(buf), "%.1f m", GNSS_altitudeMeters());
        return String(buf);
    }
    return String("&#1085;&#1077;&#1090;");
}


//------------------------------------------------------------------------------
// Назначение функции: Вычисляет runtime local coordinates по текущим данным проекта и возвращает готовый результат.
//------------------------------------------------------------------------------
static void applyRuntimeLocalCoordinates()
{
    if (!settings) return;

    settings->input_coordinates = FlyRfMode_usesLocalCoordinates(settings->mode) ? IMPUT_COORD_MANUAL : IMPUT_COORD_GNSS;
    GNSS_applyCurrentStateToThisAircraft();
}

//------------------------------------------------------------------------------
// Назначение функции: Выполняет логику функции `sourceName` и обрабатывает source name в контексте модуля WebRF.cpp.
//------------------------------------------------------------------------------
static const char* sourceName(TrafficSource source)
{
    switch (source)
    {
        case TRAFFIC_SOURCE_FLARM_LORA:    return "FLARM";
        case TRAFFIC_SOURCE_ADSB_DUMP1090: return "ADS-B";
        case TRAFFIC_SOURCE_UNKNOWN:
        default:                           return "?";
    }
}

//------------------------------------------------------------------------------
// Назначение функции: Выполняет логику функции `trackerSendName` и обрабатывает трекер name в контексте модуля WebRF.cpp.
//------------------------------------------------------------------------------
static const char* trackerSendName(uint8_t v)
{
    switch (v)
    {
        case 1: return "Single";
        case 2: return "Auto";
        case 3: return "Mini";
        default: return "Off";
    }
}

//------------------------------------------------------------------------------
// Назначение функции: Выполняет логику функции `workModeName` и обрабатывает work режим name в контексте модуля WebRF.cpp.
//------------------------------------------------------------------------------
static const char* workModeName(uint8_t mode)
{
    switch (mode)
    {
        case FLYRF_MODE_TXRX_TEST1: return "&#1057;&#1072;&#1084;&#1086;&#1083;&#1077;&#1090; &#1079;&#1072;&#1092;&#1080;&#1082;&#1089;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;";
        case FLYRF_MODE_TXRX_TEST2: return "&#1057;&#1072;&#1084;&#1086;&#1083;&#1077;&#1090; &#1074; &#1087;&#1086;&#1083;&#1077;&#1090;&#1077;";
        case FLYRF_MODE_TXRX_TEST3: return "&#1057;&#1072;&#1084;&#1086;&#1083;&#1077;&#1090; + 5 &#1089;&#1080;&#1085;&#1093;&#1088;&#1086;&#1085;&#1085;&#1086;";
        case FLYRF_MODE_TXRX_TEST4: return "&#1057;&#1072;&#1084;&#1086;&#1083;&#1077;&#1090; + 5 &#1085;&#1077; &#1089;&#1080;&#1085;&#1093;&#1088;&#1086;&#1085;&#1085;&#1086;";
        case FLYRF_MODE_NORMAL:
        default: return "&#1053;&#1086;&#1088;&#1084;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1088;&#1077;&#1078;&#1080;&#1084;";
    }
}


//------------------------------------------------------------------------------
// Назначение функции: Выполняет логику функции `nmeaName` и обрабатывает nmea name в контексте модуля WebRF.cpp.
//------------------------------------------------------------------------------
static const char* nmeaName(uint8_t mode)
{
    switch (mode)
    {
        case NMEA_OUTPUT_SERIAL: return "Serial";
        case NMEA_OUTPUT_UDP: return "UDP";
        case NMEA_OUTPUT_BLUETOOTH: return "Bluetooth";
        default: return "Off";
    }
}

//------------------------------------------------------------------------------
// Назначение функции: Выполняет логику функции `rfProtocolName` и обрабатывает радиоканал выбранный протокол name в контексте модуля WebRF.cpp.
//------------------------------------------------------------------------------
static const char* rfProtocolName(uint8_t protocol)
{
    switch (protocol)
    {
        case RF_PROTOCOL_MAVLINK: return "MAVLink";
        case RF_PROTOCOL_OGNTP:
        default: return "OGNTP";
    }
}

//------------------------------------------------------------------------------
// Назначение функции: Разбирает радиоканал выбранный протокол arg, выделяет из входной строки поля и преобразует их в рабочие значения проекта.
// Локальные переменные: parsed — рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла.
//------------------------------------------------------------------------------
static uint8_t parseRfProtocolArg(const String& value)
{
    const int parsed = value.toInt();
    return (parsed == (int)RF_PROTOCOL_MAVLINK) ? RF_PROTOCOL_MAVLINK : RF_PROTOCOL_OGNTP;
}

//------------------------------------------------------------------------------
// Назначение функции: Выполняет логику функции `serialModeName` и обрабатывает порт Serial режим name в контексте модуля WebRF.cpp.
//------------------------------------------------------------------------------
static const char* serialModeName(uint8_t mode)
{
    switch (mode)
    {
        case OUTPUT_MODE_CONTAINER: return "Container";
        case OUTPUT_MODE_NMEA: return "NMEA";
        case OUTPUT_MODE_RP2040: return "RP2040 RX";
        case OUTPUT_MODE_FLARM: return "FLARM RX";
        case OUTPUT_MODE_LORA_RAW: return "LoRa RAW RX";
        case OUTPUT_MODE_MAVLINK: return "MAVLink";
        default: return "&#1053;&#1077; &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090;&#1100;";
    }
}

//------------------------------------------------------------------------------
// Назначение функции: Выполняет логику функции `rs485ModeName` и обрабатывает канал RS485 режим name в контексте модуля WebRF.cpp.
//------------------------------------------------------------------------------
static const char* rs485ModeName(uint8_t mode)
{
    switch (mode)
    {
        case OUTPUT_MODE_CONTAINER: return "Container";
        case OUTPUT_MODE_NMEA: return "NMEA";
        case OUTPUT_MODE_RS485_DISPLAY: return "&#1042;&#1085;&#1077;&#1096;&#1085;&#1080;&#1081; &#1076;&#1080;&#1089;&#1087;&#1083;&#1077;&#1081;";
        case OUTPUT_MODE_FLARM: return "FLARM RX";
        case OUTPUT_MODE_MAVLINK: return "MAVLink";
        default: return "&#1053;&#1077; &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090;&#1100;";
    }
}

//------------------------------------------------------------------------------
// Назначение функции: Выполняет логику функции `bluetoothModeName` и обрабатывает Bluetooth режим name в контексте модуля WebRF.cpp.
//------------------------------------------------------------------------------
static const char* bluetoothModeName(uint8_t mode)
{
    switch (mode)
    {
        case BLUETOOTH_LE: return "LE";
        default: return "Off";
    }
}

//------------------------------------------------------------------------------
// Назначение функции: Выполняет логику функции `onOffName` и обрабатывает off name в контексте модуля WebRF.cpp.
//------------------------------------------------------------------------------
static const char* onOffName(uint8_t v)
{
    return v ? "&#1042;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;" : "&#1042;&#1099;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;";
}

static const char* yesNo(uint8_t v, const char* noTxt = "&#1053;&#1077;&#1090;", const char* yesTxt = "&#1044;&#1072;")
{
    return v ? yesTxt : noTxt;
}

//------------------------------------------------------------------------------
// Назначение функции: Выполняет логику функции `tftMemoryViewName` и обрабатывает tft memory режим отображения name в контексте модуля WebRF.cpp.
//------------------------------------------------------------------------------
static const char* tftMemoryViewName(uint8_t v)
{
    return yesNo(v, "&#1042;&#1099;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;", "&#1042;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;");
}

//------------------------------------------------------------------------------
// Назначение функции: Выводит режим name пользователю на экран или в текстовый блок интерфейса.
//------------------------------------------------------------------------------
static const char* displayModeName(uint8_t mode)
{
    switch (mode)
    {
        case INFO_DISPLAY_COORDINATE: return "&#1057; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;&#1072;&#1084;&#1080;";
        case INFO_DISPLAY_MAXI:       return "&#1055;&#1086;&#1083;&#1085;&#1072;&#1103; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103;";
        case INFO_DISPLAY_LORA_RAW:   return "LoRa RAW RX";
        case INFO_DISTLAY_OFF:
        default:                      return "&#1053;&#1077; &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090;&#1100;";
    }
}

//------------------------------------------------------------------------------
// Назначение функции: Выполняет логику функции `loraFixedModeName` и обрабатывает радиопараметры LoRa fixed режим name в контексте модуля WebRF.cpp.
//------------------------------------------------------------------------------
static const char* loraFixedModeName(uint8_t mode)
{
    (void)mode;
    return "Fixed";
}

//------------------------------------------------------------------------------
// Назначение функции: Выполняет логику функции `loraFixedFreqName` и обрабатывает радиопараметры LoRa fixed частоту name в контексте модуля WebRF.cpp.
//------------------------------------------------------------------------------
static const char* loraFixedFreqName(uint8_t idx)
{
    (void)idx;
    return "868.8 MHz";
}

//------------------------------------------------------------------------------
// Назначение функции: Выполняет логику функции `radarRangeModeName` и обрабатывает радар диапазон просмотра режим name в контексте модуля WebRF.cpp.
//------------------------------------------------------------------------------
static const char* radarRangeModeName(uint8_t mode)
{
    return mode ? "&#1060;&#1080;&#1082;&#1089;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081;" : "&#1040;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081;";
}

//------------------------------------------------------------------------------
// Назначение функции: Выполняет логику функции `loraRuntimeModeText` и обрабатывает радиопараметры LoRa runtime режим текст в контексте модуля WebRF.cpp.
// Локальные переменные: runtimeProfile — параметр радиоканала или протокола: описывает частоту, мощность, профиль, режим передачи или текущее состояние rf; 
// syncBuf — текстовая строка или буфер: хранит входное сообщение, сформированный ответ либо промежуточный текст; 
// html — текстовая строка или буфер: хранит входное сообщение, сформированный ответ либо промежуточный текст.
// - syncBuf: Буфер, текстовая строка или рабочее сообщение.
// - html: Параметр геометрии, координаты, размера или угла.
//------------------------------------------------------------------------------
static String loraRuntimeModeText()
{
    RF_LoraRuntimeInfo info = {};  // Структура настроек, состояния или набора рабочих данных.
    if (!RF_GetLoraRuntimeInfo(info) || !info.valid)
    {
        return String("недоступно");
    }

    const char* runtimeProfile = "OGN compatible / custom";  //
    if (info.bandwidthKHz == 125 && info.spreadingFactor == 9 && info.codingRateDenom == 6)
    {
        runtimeProfile = "Long range";
    }
    else if (info.bandwidthKHz == 125 && info.spreadingFactor == 12 && info.codingRateDenom == 8)
    {
        runtimeProfile = "Max range";
    }
    else if (info.bandwidthKHz == 125 && info.spreadingFactor == 8 && info.codingRateDenom == 6)
    {
        runtimeProfile = "Fast robust";
    }

    char syncBuf[16];  // Текстовая строка или буфер: хранит входное сообщение, сформированный ответ либо промежуточный текст.
    snprintf(syncBuf, sizeof(syncBuf), "%02X", (unsigned)info.syncWord);

    String html;  // Текстовая строка или буфер: хранит входное сообщение, сформированный ответ либо промежуточный текст.
    html.reserve(900);
    html += F("<table style='width:100%;border-collapse:collapse;table-layout:fixed;'>");
    html += String("<tr><th class='left' style='width:54%;padding:2px 8px 2px 0;'>Профиль</th><td style='padding:2px 0;text-align:right;'>") + runtimeProfile + String("</td></tr>");
    html += String("<tr><th class='left' style='padding:2px 8px 2px 0;'>Частота</th><td style='padding:2px 0;text-align:right;'>") + String((double)info.frequencyHz / 1000000.0, 3) + String(" MHz</td></tr>");
    html += String("<tr><th class='left' style='padding:2px 8px 2px 0;'>SF</th><td style='padding:2px 0;text-align:right;'>") + String(info.spreadingFactor) + String("</td></tr>");
    html += String("<tr><th class='left' style='padding:2px 8px 2px 0;'>BW</th><td style='padding:2px 0;text-align:right;'>") + String(info.bandwidthKHz) + String(" kHz</td></tr>");
    html += String("<tr><th class='left' style='padding:2px 8px 2px 0;'>CR</th><td style='padding:2px 0;text-align:right;'>4/") + String(info.codingRateDenom) + String("</td></tr>");
    html += String("<tr><th class='left' style='padding:2px 8px 2px 0;'>SyncWord</th><td style='padding:2px 0;text-align:right;'>0x") + String(syncBuf) + String("</td></tr>");
    html += String("<tr><th class='left' style='padding:2px 8px 2px 0;'>RX symbols</th><td style='padding:2px 0;text-align:right;'>") + String(info.rxSymbols) + String("</td></tr>");
    html += String("<tr><th class='left' style='padding:2px 8px 2px 0;'>TX power</th><td style='padding:2px 0;text-align:right;'>") + String(info.txPowerDbm) + String(" dBm</td></tr>");
    html += String("<tr><th class='left' style='padding:2px 8px 2px 0;'>LowDataRateOptimize</th><td style='padding:2px 0;text-align:right;'>") + (info.lowDataRateOptimize ? String("On") : String("Off")) + String("</td></tr>");
    html += String("<tr><th class='left' style='padding:2px 8px 2px 0;'>CRC payload</th><td style='padding:2px 0;text-align:right;'>") + (info.crcOnPayload ? String("On") : String("Off")) + String("</td></tr>");
    html += String("<tr><th class='left' style='padding:2px 8px 2px 0;'>Header mode</th><td style='padding:2px 0;text-align:right;'>") + (info.implicitHeader ? String("Implicit") : String("Explicit")) + String("</td></tr>");
    html += F("</table>");
    return html;
}

//------------------------------------------------------------------------------
// Назначение функции: Выполняет логику функции `loraRuntimeSourceText` и обрабатывает радиопараметры LoRa runtime source текст в контексте модуля WebRF.cpp.
//------------------------------------------------------------------------------
static String loraRuntimeSourceText()
{
    return RF_GetLoraRegistersSourceText();
}

