MoseychukA/FLARM_ALL/ChatGPT_FlyRF/ESP32_Base/FlyRf_Base_26_04_22_12/WebRF.cpp
//------------------------------------------------------------------------------
// Назначение функции: Выполняет логику функции `loraRuntimeSettingsBlock` и обрабатывает радиопараметры LoRa runtime настройки block в контексте модуля WebRF.cpp.
// Локальные переменные: html — текстовая строка или буфер: хранит входное сообщение, сформированный ответ либо промежуточный текст.
// - html: Параметр геометрии, координаты, размера или угла.
//------------------------------------------------------------------------------
static String loraRuntimeSettingsBlock(const char* titleHtml, bool centeredTitle = false)
{
    String html;  // Текстовая строка или буфер: хранит входное сообщение, сформированный ответ либо промежуточный текст.
    html.reserve(1400);
    html += F("<div class='settingsBlock'><div class='blockTitle");
    if (centeredTitle) html += F(" blockTitleCenter");
    html += F("'>");
    html += (titleHtml ? String(titleHtml) : String("LoRa / LMIC"));
    html += F("</div>");
    html += loraRuntimeModeText();
    html += F("<table><tr><th>Источник данных LMIC / LoRa</th><td>");
    html += loraRuntimeSourceText();
    html += F("</td></tr></table></div>");
    return html;
}

//------------------------------------------------------------------------------
// Назначение функции: Разбирает IP-адрес arg, выделяет из входной строки поля и преобразует их в рабочие значения проекта.
// Локальные переменные: a — рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла; 
// b — рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла; 
// c — рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла; 
// d — рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла.
// - b: Служебная переменная, используемая для промежуточных вычислений и логики модуля.
// - c: Служебная переменная, используемая для промежуточных вычислений и логики модуля.
// - d: Служебная переменная, используемая для промежуточных вычислений и логики модуля.
//------------------------------------------------------------------------------
static void parseIpArg(const String& name, uint8_t out[4])
{
    if (!server.hasArg(name) || out == nullptr) return;

    int a = 0, b = 0, c = 0, d = 0;  //
    if (sscanf(server.arg(name).c_str(), "%d.%d.%d.%d", &a, &b, &c, &d) == 4)
    {
        out[0] = (uint8_t)clampInt(a, 0, 255);
        out[1] = (uint8_t)clampInt(b, 0, 255);
        out[2] = (uint8_t)clampInt(c, 0, 255);
        out[3] = (uint8_t)clampInt(d, 0, 255);
    }
}


//------------------------------------------------------------------------------
// Назначение функции: Разбирает IP-адрес arg value, выделяет из входной строки поля и преобразует их в рабочие значения проекта.
// Локальные переменные: a — рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла; 
// b — рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла; 
// c — рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла; 
// d — рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла.
// - b: Служебная переменная, используемая для промежуточных вычислений и логики модуля.
// - c: Служебная переменная, используемая для промежуточных вычислений и логики модуля.
// - d: Служебная переменная, используемая для промежуточных вычислений и логики модуля.
//------------------------------------------------------------------------------
static void parseIpArgFromValue(const String& value, uint8_t out[4])
{
    if (out == nullptr) return;

    int a = 0, b = 0, c = 0, d = 0;  //
    if (sscanf(value.c_str(), "%d.%d.%d.%d", &a, &b, &c, &d) == 4)
    {
        out[0] = (uint8_t)clampInt(a, 0, 255);
        out[1] = (uint8_t)clampInt(b, 0, 255);
        out[2] = (uint8_t)clampInt(c, 0, 255);
        out[3] = (uint8_t)clampInt(d, 0, 255);
    }
}

//------------------------------------------------------------------------------
// Назначение функции: Выполняет логику функции `jsonEscape` и обрабатывает JSON-ответ escape в контексте модуля WebRF.cpp.
// Локальные переменные: out — рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла.
// - out: Служебная переменная, используемая для промежуточных вычислений и логики модуля.
//------------------------------------------------------------------------------
static String jsonEscape(const String& src)
{
    String out;  //
    out.reserve(src.length() + 8);
    for (size_t i = 0; i < src.length(); ++i)
    {
        const char c = src[i];  //
        if (c == '\\' || c == '"') out += '\\';
        if (c == '\r' || c == '\n') out += ' ';
        else out += c;
    }
    return out;
}

//------------------------------------------------------------------------------
// Назначение функции: Выполняет логику функции `distanceKm` и обрабатывает distance km в контексте модуля WebRF.cpp.
// Локальные переменные: DEG_TO_RAD_F — рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла; 
// R — рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла; 
// p1 — рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла; 
// p2 — рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла; 
// dp — рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла; 
// dl — рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла.
//------------------------------------------------------------------------------
static float distanceKm(float lat1, float lon1, float lat2, float lon2)
{
    const float DEG_TO_RAD_F = 0.017453292519943295769f;  //
    const float R = 6371.0f;  //

    const float p1 = lat1 * DEG_TO_RAD_F;  //
    const float p2 = lat2 * DEG_TO_RAD_F;  //
    const float dp = (lat2 - lat1) * DEG_TO_RAD_F;
    const float dl = (lon2 - lon1) * DEG_TO_RAD_F;

    const float a = sinf(dp * 0.5f) * sinf(dp * 0.5f) +
                    cosf(p1) * cosf(p2) * sinf(dl * 0.5f) * sinf(dl * 0.5f);
    const float c = 2.0f * atan2f(sqrtf(a), sqrtf(1.0f - a));
    return R * c;
}

//------------------------------------------------------------------------------
// Назначение функции: Инициализирует HTML-страницу, подготавливает связанные объекты и включает работу соответствующего узла.
// Локальные переменные: s — рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла; 
// initial — рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла.
// - s: Служебная переменная, используемая для промежуточных вычислений и логики модуля.
// - serif: Служебная переменная, используемая для промежуточных вычислений и логики модуля.
// - input: Служебная переменная, используемая для промежуточных вычислений и логики модуля.
// - monospace: Служебная переменная, используемая для промежуточных вычислений и логики модуля.
// - tbody: Параметр геометрии, координаты, размера или угла.
// - tr: Служебная переменная, используемая для промежуточных вычислений и логики модуля.
// - th: Параметр геометрии, координаты, размера или угла.
//------------------------------------------------------------------------------
static String htmlBegin(const String& title)
{
    String s;  //
    s.reserve(5000);
    s += F("<!DOCTYPE html><html><head><meta charset='utf-8'>");
    s += F("<meta name='viewport' content='width=device-width, initial-scale=1'>");
    s += F("<title>");
    s += title;
    s += F("</title>");
    s += F("<style>");
    s += F("body{font-family:Arial,'Times New Roman',serif;background:#f3f3f3;color:#000;margin:0;padding:0;}");
    s += F(".page{max-width:980px;margin:0 auto;padding:8px 12px 28px 12px;}");
    s += F("h1{font-size:32px;line-height:1.08;text-align:center;font-weight:700;margin:10px 0 18px 0;}");
    s += F("h2{font-size:22px;line-height:1.1;text-align:center;font-weight:700;margin:8px 0 14px 0;}");
    s += F("table{width:100%;border-collapse:collapse;}");
    s += F("th,td{font-size:17px;line-height:1.18;padding:4px 0;vertical-align:top;}");
    s += F("th{text-align:left;font-weight:700;padding-right:10px;}");
    s += F("td{text-align:right;font-weight:400;}");
    s += F(".left{text-align:left;}.center{text-align:center;}");
    s += F(".hr{height:1px;background:#9a9a9a;margin:12px 0 14px 0;}");
    s += F(".settingsBlock{background:#fff;border:1px solid #cfcfcf;border-radius:8px;padding:10px 12px 12px 12px;margin:0 0 12px 0;box-shadow:0 1px 2px rgba(0,0,0,.05);overflow:hidden;}");
    s += F(".blockTitle{font-size:20px;line-height:1.1;font-weight:700;text-align:left;margin:0 0 8px 0;color:#1f1f1f;}");
    s += F(".blockTitleCenter{text-align:center;}");
    s += F(".settingsBlock table{margin:0;}");
    s += F(".note{font-size:17px;line-height:1.28;color:#333;text-align:right;overflow-wrap:anywhere;word-break:break-word;}");
    s += F(".hardwareCompactBlock table{table-layout:fixed;} .hardwareCompactBlock th{width:42%;} .hardwareCompactBlock td{width:58%;overflow:hidden;} .hardwareCompactBlock select,.hardwareCompactBlock input,.hardwareCompactBlock .note{width:100%;min-width:0;max-width:100%;box-sizing:border-box;} .hardwareCompactBlock .wShort,.hardwareCompactBlock .wMed,.hardwareCompactBlock .wLong,.hardwareCompactBlock .compactSelect,.hardwareCompactBlock .hardwareCtl,.hardwareCompactBlock .hardwareCtl50,.hardwareCompactBlock .hardwareCtl30,.hardwareCompactBlock .hardwareCtl60{width:100%;min-width:0;max-width:100%;}");
    s += F(".btnRow{display:flex;justify-content:center;align-items:center;gap:8px;flex-wrap:wrap;margin:6px 0 0 0;}");
    s += F(".btn{display:inline-flex;justify-content:center;align-items:center;font-family:Arial,'Times New Roman',serif;font-size:22px;line-height:1.12;padding:13px 14px;margin:0;border:1px solid #8b8b8b;border-radius:3px;background:#ececec;color:#000;text-decoration:none;cursor:pointer;width:auto;min-width:148px;max-width:100%;box-sizing:border-box;text-align:center;white-space:nowrap;}.btnIcon{display:inline-block;font-size:1.48em;line-height:1;vertical-align:-0.12em;margin-right:0.30em;}.settingsTopCtl,.hardwareCtl,.settingsTopCtl50,.settingsTopCtl30,.hardwareCtl50,.hardwareCtl30,.hardwareCtl60,.wShort,.wMed,.wLong{width:auto;min-width:148px;max-width:100%;}.wShort{min-width:112px;}.wMed{min-width:148px;}.wLong{min-width:220px;}.compactSelect{width:250px;min-width:250px;max-width:250px;}");
    s += F("input[type=text],input[type=number],select{font-family:Arial,'Times New Roman',serif;font-size:20px;line-height:1.1;box-sizing:border-box;border:1px solid #8b8b8b;border-radius:3px;background:#fff;height:42px;padding:6px 9px;width:auto;min-width:148px;max-width:100%;}.compactSelect{font-size:18px;padding-right:28px;}");
    s += F("input[type=file]{position:absolute;left:-9999px;width:1px;height:1px;opacity:0;}");
    s += F(".btn.autoWide,.autoWide{min-width:220px;}.btn.autoNarrow,.autoNarrow{min-width:140px;}");
    s += F(".confirmTitle{font-size:20px;font-weight:700;text-align:center;line-height:1.22;margin-top:10px;}");
    s += F(".smallNote{font-size:15px;line-height:1.3;color:#444;margin-top:6px;text-align:right;}");
    s += F(".liveState{display:inline-block;min-width:230px;text-align:left;font-size:15px;line-height:1.25;color:#1d4f91;padding-top:7px;}");
    s += F(".about{font-size:18px;line-height:1.5;text-align:center;}");
    s += F(".monTools{display:flex;gap:8px;align-items:center;justify-content:space-between;flex-wrap:wrap;margin:4px 0 10px 0;}");
    s += F(".monInfo{font-size:18px;line-height:1.25;}");
    s += F(".monTable th,.monTable td{font-size:15px;padding:5px 4px;border-bottom:1px solid #d0d0d0;}");
    s += F(".monTable th{text-align:center;background:#ebebeb;position:sticky;top:0;}");
    s += F(".monTable td{text-align:center;}");
    s += F(".mono{font-family:Consolas,'Courier New',monospace;}");
    s += F(".progressWrap{max-width:560px;margin:12px auto 0 auto;border:1px solid #8b8b8b;background:#fff;height:24px;border-radius:4px;overflow:hidden;}");
    s += F(".progressBar{height:100%;width:0%;background:#7fa7ff;transition:width .15s;}");
    s += F(".btnRowEqual{display:flex;justify-content:center;gap:12px;flex-wrap:wrap;margin-top:12px;}");
    s += F(".btnRowEqual .btn{width:260px;max-width:100%;box-sizing:border-box;}");
    s += F(".viewToggleWrap{text-align:right;margin:0 0 8px 0;}.viewToggle{display:inline-block;font-family:Arial,'Times New Roman',serif;font-size:15px;line-height:1.1;padding:7px 12px;border:1px solid #8b8b8b;border-radius:3px;background:#ececec;color:#000;text-decoration:none;cursor:pointer;}");
    s += F(".frontBtn{width:260px;min-width:260px;height:38px;padding:8px 12px;font-size:20px;transition:background .15s,border-color .15s,color .15s,box-shadow .15s;}");
    s += F(".frontBtn.active{background:#0f8a0f;border-color:#13b913;color:#fff;box-shadow:0 0 8px rgba(20,185,20,.35);}");
    s += F(".frontBtn.data{background:#d7c432;border-color:#e8d94c;color:#111;box-shadow:0 0 8px rgba(220,200,50,.35);}");
    s += F(".frontBtn.error{background:#b53333;border-color:#d94a4a;color:#fff;box-shadow:0 0 8px rgba(217,74,74,.35);}");
    s += F("body.mobileUi .page{max-width:560px;padding:10px 10px 28px 10px;}");
    s += F("body.mobileUi h1{font-size:28px;line-height:1.12;margin:8px 0 14px 0;}body.mobileUi h2{font-size:22px;line-height:1.14;margin:8px 0 12px 0;}");
    s += F("body.mobileUi table,body.mobileUi tbody,body.mobileUi tr,body.mobileUi th,body.mobileUi td{display:block;width:100%;box-sizing:border-box;}");
    s += F("body.mobileUi tr{padding:0 0 10px 0;border-bottom:1px solid #d6d6d6;margin:0 0 10px 0;}body.mobileUi th{font-size:16px;line-height:1.25;padding:0 0 5px 0;text-align:left;}body.mobileUi td{text-align:left;padding:0;}");
    s += F("body.mobileUi input[type=text],body.mobileUi input[type=number],body.mobileUi select{width:100%;max-width:100%;height:44px;font-size:18px;padding:8px 10px;}");
    s += F("body.mobileUi .wShort,body.mobileUi .wMed,body.mobileUi .wLong,body.mobileUi .settingsTopCtl,body.mobileUi .settingsTopCtl50,body.mobileUi .settingsTopCtl30,body.mobileUi .hardwareCtl,body.mobileUi .hardwareCtl50,body.mobileUi .hardwareCtl30,body.mobileUi .hardwareCtl60,body.mobileUi .compactSelect{width:100%;min-width:0;max-width:100%;}body.mobileUi .btn{display:block;width:100%;min-width:0;font-size:18px;line-height:1.15;padding:12px 12px;margin:6px 0;}");
    s += F("body.mobileUi .btnRow{display:block;margin:6px 0 0 0;}body.mobileUi .liveState{display:block;min-width:0;width:100%;text-align:left;font-size:14px;padding-top:6px;}body.mobileUi .smallNote{text-align:left;}");
    s += F("body.mobileUi .frontBtn{width:100%;min-width:0;font-size:18px;height:40px;}");
    s += F("body.mobileUi .monTools{display:block;}body.mobileUi .monTools .btn{margin-top:6px;}body.mobileUi .monInfo{font-size:16px;margin-bottom:6px;}");
    s += F("body.mobileUi .monTable{display:block;overflow-x:auto;}body.mobileUi .monTable th,body.mobileUi .monTable td{display:table-cell;width:auto;white-space:nowrap;}");
    s += F("@media (max-width:760px){h1{font-size:30px;}th,td{font-size:16px;}input[type=text],input[type=number],input[type=file],select{font-size:16px;width:170px;height:34px;}select.compactSelect{width:170px;max-width:100%;}.btn{font-size:15px;padding:7px 12px;}.monTable th,.monTable td{font-size:13px;padding:4px 3px;}}");    s += F("</style><script>(function(){var mode='desktop';try{mode=localStorage.getItem('flyrf_ui_mode')||'desktop';}catch(e){}if(mode==='mobile'){document.documentElement.className+=' mobileUi';}})();</script></head><body><div class='page'><div class='viewToggleWrap'><button type='button' id='uiModeToggle' class='viewToggle'><span class='btnIcon'>&#128187;</span>&#1056;&#1077;&#1078;&#1080;&#1084;: &#1055;&#1050;</button></div>");
    s += F("<script>(function(){var root=document.documentElement;var body=document.body;function setButton(mobile){var btn=document.getElementById('uiModeToggle');if(!btn)return;btn.innerHTML=mobile?\"<span class='btnIcon'>&#128241;</span>&#1056;&#1077;&#1078;&#1080;&#1084;: &#1058;&#1077;&#1083;&#1077;&#1092;&#1086;&#1085;\":\"<span class='btnIcon'>&#128187;</span>&#1056;&#1077;&#1078;&#1080;&#1084;: &#1055;&#1050;\";}function apply(mode){var mobile=(mode==='mobile');if(body)body.classList.toggle('mobileUi',mobile);root.classList.toggle('mobileUi',mobile);setButton(mobile);try{localStorage.setItem('flyrf_ui_mode',mobile?'mobile':'desktop');}catch(e){}}var start='desktop';try{start=localStorage.getItem('flyrf_ui_mode')||'desktop';}catch(e){}apply(start);document.addEventListener('click',function(ev){var t=ev.target;if(!t)return;while(t&&t.id!='uiModeToggle'&&t!==document.body){t=t.parentNode;}if(t&&t.id=='uiModeToggle'){apply((body&&body.classList.contains('mobileUi'))?'desktop':'mobile');}});})();</script>");
    return s;
}

//------------------------------------------------------------------------------
// Назначение функции: Формирует и отправляет страницу через нужный интерфейс связи или вывода.
//------------------------------------------------------------------------------
static void sendPage(const String& html)
{
    sendNoCache();
    server.send(200, "text/html; charset=utf-8", html);
}

//------------------------------------------------------------------------------
// Назначение функции: Формирует и отправляет validation error страницу через нужный интерфейс связи или вывода.
// Локальные переменные: html — текстовая строка или буфер: хранит входное сообщение, сформированный ответ либо промежуточный текст.
//------------------------------------------------------------------------------
static void sendValidationErrorPage(const String& title, const String& message)
{
    String html = htmlBegin(title);
    html += F("<h1>");
    html += title;
    html += F("</h1><div class='settingsBlock'><div class='confirmTitle'>");
    html += message;
    html += F("</div><div class='btnRow'><a class='btn' href='/hardware_settings'><span class='btnIcon'>&#8634;</span>&#1042;&#1077;&#1088;&#1085;&#1091;&#1090;&#1100;&#1089;&#1103; &#1082; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1072;&#1084;</a></div></div></div></body></html>");
    sendPage(html);
}

//------------------------------------------------------------------------------
// Назначение функции: Выполняет логику функции `normalizeBlockAddrText` и обрабатывает block адрес текст в контексте модуля WebRF.cpp.
//------------------------------------------------------------------------------
static bool normalizeBlockAddrText(const String& value, String& normalized)
{
    normalized = value;
    normalized.trim();
    normalized.toUpperCase();


    if (normalized.length() != 6)
    {
        return false;
    }

