MoseychukA/FLARM_ALL/ChatGPT_FlyRF/ESP32_Base/FlyRf_Base_26_04_22_12/WebRF.cpp
    for (size_t i = 0; i < normalized.length(); ++i)
    {
        const char c = normalized.charAt(i);
        const bool digit = (c >= '0' && c <= '9');
        const bool latinHex = (c >= 'A' && c <= 'F');
        if (!digit && !latinHex)
        {
            return false;
        }
    }

    return true;
}

//------------------------------------------------------------------------------
// Назначение функции: Разбирает block адрес arg, выделяет из входной строки поля и преобразует их в рабочие значения проекта.
// Локальные переменные: normalized — рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла; 
// nullptr — рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла.
// - normalized: Служебная переменная, используемая для промежуточных вычислений и логики модуля.
//------------------------------------------------------------------------------
static uint32_t parseBlockAddrArg(const String& value)
{
    String normalized;  //
    if (!normalizeBlockAddrText(value, normalized))
    {
        return 0U;
    }

    if (normalized.length() == 0)
    {
        return 0U;
    }

    const unsigned long parsed = strtoul(normalized.c_str(), nullptr, 16);
    if (parsed > 0xFFFFFFUL)
    {
        return 0U;
    }
    return (uint32_t)parsed;
}

//------------------------------------------------------------------------------
// Назначение функции: Считывает block адрес arg из внешнего интерфейса, памяти или регистра и подготавливает значение для дальнейшей обработки.
// Локальные переменные: raw — рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла.
//------------------------------------------------------------------------------
static bool readBlockAddrArg(const char* argName, uint32_t& outValue, String& normalized, String& errorText)
{
    normalized = String();
    errorText = String();
    outValue = 0U;

    if (!server.hasArg(argName))
    {
        return true;
    }

    const String raw = server.arg(argName);
    if (!normalizeBlockAddrText(raw, normalized))
    {
        errorText = F("&#1053;&#1077;&#1074;&#1077;&#1088;&#1085;&#1099;&#1081; &#1074;&#1074;&#1086;&#1076; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072; &#1074; &#1087;&#1086;&#1083;&#1077; ");
        errorText += argName;
        errorText += F(". &#1042;&#1074;&#1077;&#1076;&#1080;&#1090;&#1077; 6 HEX-&#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1086;&#1074;: 0-9 &#1080; A-F.");
        return false;
    }

    outValue = parseBlockAddrArg(normalized);
    return true;
}

//------------------------------------------------------------------------------
// Назначение функции: Выполняет логику функции `blockAddrInputFilterScript` и обрабатывает block адрес input filter script в контексте модуля WebRF.cpp.
// Локальные переменные: s — рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла.
// - s: Служебная переменная, используемая для промежуточных вычислений и логики модуля.
//------------------------------------------------------------------------------
static String blockAddrInputFilterScript(const char* inputName)
{
    String s;  //
    s.reserve(320);
    s += F("<script>(function(){var el=document.querySelector('input[name=\"");
    s += inputName;
    s += F("\"]');if(!el)return;function norm(forceZero){var v=(el.value||'').toUpperCase().replace(/[^0-9A-F]/g,'').slice(0,6);if(forceZero&&v.length===0)v='000000';if(el.value!==v)el.value=v;}el.addEventListener('input',function(){norm(false);});el.addEventListener('blur',function(){norm(true);});norm(true);})();</script>");
    return s;
}

//------------------------------------------------------------------------------
// Назначение функции: Формирует block адрес в готовом виде для вывода, передачи или последующей обработки.
//------------------------------------------------------------------------------
static void formatBlockAddr(char* out, size_t outSize, uint32_t value)
{
    if (out == nullptr || outSize == 0)
    {
        return;
    }

    snprintf(out, outSize, "%06lX", (unsigned long)(value & 0xFFFFFFUL));
}

//------------------------------------------------------------------------------
// Назначение функции: Формирует block адрес summary в готовом виде для вывода, передачи или последующей обработки.
//------------------------------------------------------------------------------
static void formatBlockAddrSummary(char* out, size_t outSize, uint32_t value)
{
    if (out == nullptr || outSize == 0)
    {
        return;
    }

    snprintf(out, outSize, "%06lX", (unsigned long)(value & 0xFFFFFFUL));
}

//------------------------------------------------------------------------------
// Назначение функции: Выполняет логику функции `blockAddrSummary` и обрабатывает block адрес summary в контексте модуля WebRF.cpp.
// Локальные переменные: addr1 — параметр конфигурации: хранит выбранный режим, адрес, настройки модуля или пользовательское значение; 
// addr2 — параметр конфигурации: хранит выбранный режим, адрес, настройки модуля или пользовательское значение; 
// addr3 — параметр конфигурации: хранит выбранный режим, адрес, настройки модуля или пользовательское значение; 
// s — рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла.
// - addr1: Параметр конфигурации интерфейса, адресации или выбранного режима.
// - addr2: Параметр конфигурации интерфейса, адресации или выбранного режима.
// - addr3: Параметр конфигурации интерфейса, адресации или выбранного режима.
// - s: Служебная переменная, используемая для промежуточных вычислений и логики модуля.
//------------------------------------------------------------------------------
static String blockAddrSummary()
{
    char addr1[16];  // Параметр конфигурации: хранит выбранный режим, адрес, настройки модуля или пользовательское значение.
    char addr2[16];  // Параметр конфигурации: хранит выбранный режим, адрес, настройки модуля или пользовательское значение.
    char addr3[16];  // Параметр конфигурации: хранит выбранный режим, адрес, настройки модуля или пользовательское значение.
    formatBlockAddrSummary(addr1, sizeof(addr1), settings ? settings->block_addr[0] : 0U);
    formatBlockAddrSummary(addr2, sizeof(addr2), settings ? settings->block_addr[1] : 0U);
    formatBlockAddrSummary(addr3, sizeof(addr3), settings ? settings->block_addr[2] : 0U);

