MoseychukA/FLARM_ALL/ChatGPT_FlyRF/ESP32_Base/FlyRf_Base_26_04_22_12/WebRF.cpp
//------------------------------------------------------------------------------
// Назначение функции: Выполняет логику функции `hardwarePage` и обрабатывает hardware страницу в контексте модуля WebRF.cpp.
// Локальные переменные: html — текстовая строка или буфер: хранит входное сообщение, сформированный ответ либо промежуточный текст; 
// blockAddr1 — логический флаг состояния: показывает, разрешена ли операция, активен ли режим или есть ли данные; 
// blockAddr2 — логический флаг состояния: показывает, разрешена ли операция, активен ли режим или есть ли данные; 
// blockAddr3 — логический флаг состояния: показывает, разрешена ли операция, активен ли режим или есть ли данные.
// - blockAddr1: Параметр конфигурации интерфейса, адресации или выбранного режима.
// - blockAddr2: Параметр конфигурации интерфейса, адресации или выбранного режима.
// - blockAddr3: Параметр конфигурации интерфейса, адресации или выбранного режима.
//------------------------------------------------------------------------------
static String hardwarePage()
{
    String html = htmlBegin("&#1040;&#1087;&#1087;&#1072;&#1088;&#1072;&#1090;&#1085;&#1099;&#1077; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080;");
    html += F("<h1>&#1040;&#1087;&#1087;&#1072;&#1088;&#1072;&#1090;&#1085;&#1099;&#1077; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080;</h1><form id='hardware_form' action='/hardware_input' method='GET'>");
    html += F("<div class='settingsBlock'><div class='blockTitle'>&#1044;&#1080;&#1089;&#1087;&#1083;&#1077;&#1081;</div><table>");
    html += F("<tr><th>&#1054;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1090;&#1100; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; LoRa &#1085;&#1072; TFT</th><td><select class='wMed hardwareCtl50' name='rssi_view'>");
    html += String("<option ") + sel(settings && settings->rssi_view == 0) + " value='0'>&#1042;&#1099;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;</option>";
    html += String("<option ") + sel(settings && settings->rssi_view != 0) + " value='1'>&#1042;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;</option>";
    html += F("</select></td></tr>");
    html += F("<tr><th>&#1054;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1090;&#1100; GPS &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1085;&#1072; TFT</th><td><select class='wMed hardwareCtl50' name='view_gps_data'>");
    html += String("<option ") + sel(!(settings && settings->lan_state_view)) + " value='0'>&#1042;&#1099;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100;</option>";
    html += String("<option ") + sel(settings && settings->lan_state_view) + " value='1'>&#1042;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100;</option>";
    html += F("</select></td></tr>");
    html += F("<tr><th>&#1042;&#1099;&#1074;&#1086;&#1076; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1086;&#1081; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080; &#1085;&#1072; &#1076;&#1080;&#1089;&#1087;&#1083;&#1077;&#1081;</th><td><select class='wLong hardwareCtl30' name='display_set'>");
    html += String("<option ") + sel((settings ? settings->display_set : INFO_DISTLAY_OFF) == INFO_DISTLAY_OFF) + " value='0'>&#1053;&#1077; &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090;&#1100;</option>";
    html += String("<option ") + sel((settings ? settings->display_set : INFO_DISPLAY_COORDINATE) == INFO_DISPLAY_COORDINATE) + " value='1'>&#1057; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;&#1072;&#1084;&#1080;</option>";
    html += String("<option ") + sel((settings ? settings->display_set : INFO_DISPLAY_MAXI) == INFO_DISPLAY_MAXI) + " value='2'>&#1055;&#1086;&#1083;&#1085;&#1072;&#1103; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103;</option>";
    html += String("<option ") + sel((settings ? settings->display_set : INFO_DISPLAY_LORA_RAW) == INFO_DISPLAY_LORA_RAW) + " value='3'>LoRa RAW RX</option>";
    html += F("</select></td></tr>");
    html += F("<tr><th>&#1054;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1090;&#1077;&#1089;&#1090;&#1086;&#1074;&#1099;&#1093; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;</th><td><select class='wMed hardwareCtl50' name='view_test_coord'>");
    html += String("<option ") + sel(!(settings && settings->view_test_coord)) + " value='0'>&#1042;&#1099;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100;</option>";
    html += String("<option ") + sel(settings && settings->view_test_coord) + " value='1'>&#1042;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100;</option>";
    html += F("</select></td></tr>");
    html += F("<tr><th>&#1044;&#1080;&#1072;&#1087;&#1072;&#1079;&#1086;&#1085; &#1087;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1072; TFT</th><td><select class='wLong hardwareCtl50 compactSelect' style='width:210px;min-width:210px;max-width:210px;' name='radar_range_mode'>");
    html += String("<option ") + sel(!(settings && settings->radar_range_mode)) + " value='0'>&#1040;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081;</option>";
    html += String("<option ") + sel(settings && settings->radar_range_mode) + " value='1'>&#1060;&#1080;&#1082;&#1089;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081;</option>";
    html += F("</select></td></tr>");
    html += F("</table></div>");
    html += F("<div class='settingsBlock'><div class='blockTitle'>&#1050;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1100; &#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1075;&#1086; &#1089;&#1073;&#1083;&#1080;&#1078;&#1077;&#1085;&#1080;&#1103;</div><table>");
    html += F("<tr><th>&#1058;&#1088;&#1077;&#1074;&#1086;&#1075;&#1072; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077; (m)</th><td><input class='wMed hardwareCtl50' type='number' name='alarm_attention' min='2000' max='3000' value='");
    html += String(settings ? settings->alarm_attention : 3000);
    html += F("'></td></tr>");
    html += F("<tr><th>&#1058;&#1088;&#1077;&#1074;&#1086;&#1075;&#1072; &#1087;&#1088;&#1077;&#1076;&#1091;&#1087;&#1088;&#1077;&#1078;&#1076;&#1077;&#1085;&#1080;&#1077; (m)</th><td><input class='wMed hardwareCtl50' type='number' name='alarm_warning' min='200' max='2000' value='");
    html += String(settings ? settings->alarm_warning : 2000);
    html += F("'></td></tr>");
    html += F("<tr><th>&#1058;&#1088;&#1077;&#1074;&#1086;&#1075;&#1072; &#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1100; (m)</th><td><input class='wMed hardwareCtl50' type='number' name='alarm_danger' min='10' max='500' value='");
    html += String(settings ? settings->alarm_danger : 500);
    html += F("'></td></tr>");
    html += F("<tr><th>&#1058;&#1088;&#1077;&#1074;&#1086;&#1075;&#1072; &#1074;&#1099;&#1089;&#1086;&#1090;&#1072; (m)</th><td><input class='wMed hardwareCtl50' type='number' name='alarm_height' min='30' max='300' value='");
    html += String(settings ? settings->alarm_height : 300);
    html += F("'></td></tr>");
    html += F("</table></div>");
    html += F("<div class='settingsBlock hardwareCompactBlock'><div class='blockTitle'>LoRa</div><table>");
    html += F("<tr><th>RF &#1087;&#1088;&#1086;&#1090;&#1086;&#1082;&#1086;&#1083;</th><td><select class='wLong hardwareCtl50 compactSelect' name='rf_protocol'>");
    html += String("<option ") + sel((settings ? settings->rf_protocol : RF_PROTOCOL_OGNTP) == RF_PROTOCOL_OGNTP) + " value='1'>OGNTP</option>";
    html += String("<option ") + sel((settings ? settings->rf_protocol : RF_PROTOCOL_OGNTP) == RF_PROTOCOL_MAVLINK) + " value='100'>MAVLink</option>";
    html += F("</select></td></tr>");
    html += F("<tr><th>LoRa &#1095;&#1072;&#1089;&#1090;&#1086;&#1090;&#1072;</th><td>868.8 MHz</td></tr>");
    html += F("<tr><th>LoRa &#1087;&#1088;&#1086;&#1092;&#1080;&#1083;&#1100;</th><td><select class='wLong hardwareCtl50 compactSelect' name='lora_profile'>");
    html += String("<option ") + sel((settings ? settings->lora_profile : 0) == 0) + " value='0'>OGN compatible</option>";
    html += String("<option ") + sel((settings ? settings->lora_profile : 0) == 1) + " value='1'>Long range (SF9 BW125 CR4/6)</option>";
    html += String("<option ") + sel((settings ? settings->lora_profile : 0) == 2) + " value='2'>Max range (SF12 BW125 CR4/8)</option>";
    html += String("<option ") + sel((settings ? settings->lora_profile : 0) == 3) + " value='3'>Fast robust (SF8 BW125 CR4/6)</option>";
    html += F("</select></td></tr>");
    html += F("</table></div>");
    html += loraRuntimeSettingsBlock("&#1056;&#1077;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; LoRa / LMIC");
    html += F("<div class='settingsBlock'><div class='blockTitle'>&#1057;&#1083;&#1091;&#1078;&#1077;&#1073;&#1085;&#1099;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099;</div><table>");
    html += F("<tr><th>&#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;</th><td><select class='wMed hardwareCtl30' name='default_settings'>");
    html += F("<option value='0' selected>&#1053;&#1077; &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1090;&#1100;</option>");
    html += F("<option value='1'>&#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100;</option>");
    html += F("</select></td></tr>");
    char blockAddr1[16];  
    char blockAddr2[16];  
    char blockAddr3[16];  
    formatBlockAddr(blockAddr1, sizeof(blockAddr1), settings ? settings->block_addr[0] : 0U);
    formatBlockAddr(blockAddr2, sizeof(blockAddr2), settings ? settings->block_addr[1] : 0U);
    formatBlockAddr(blockAddr3, sizeof(blockAddr3), settings ? settings->block_addr[2] : 0U);
    html += F("<tr><th>&#1041;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1072;&#1076;&#1088;&#1077;&#1089; 1</th><td><input class='hardwareCtl60' type='text' name='block_addr' maxlength='6' minlength='6' pattern='[0-9A-Fa-f]{6}' required title='&#1042;&#1074;&#1077;&#1076;&#1080;&#1090;&#1077; 6 HEX-&#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1086;&#1074;: 0-9 &#1080; A-F' placeholder='000000' autocomplete='off' spellcheck='false' value='");
    html += blockAddr1;
    html += F("'></td></tr>");
    html += F("<tr><th>&#1041;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1072;&#1076;&#1088;&#1077;&#1089; 2</th><td><input class='hardwareCtl60' type='text' name='block_addr2' maxlength='6' minlength='6' pattern='[0-9A-Fa-f]{6}' required title='&#1042;&#1074;&#1077;&#1076;&#1080;&#1090;&#1077; 6 HEX-&#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1086;&#1074;: 0-9 &#1080; A-F' placeholder='000000' autocomplete='off' spellcheck='false' value='");
    html += blockAddr2;
    html += F("'></td></tr>");
    html += F("<tr><th>&#1041;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1072;&#1076;&#1088;&#1077;&#1089; 3</th><td><input class='hardwareCtl60' type='text' name='block_addr3' maxlength='6' minlength='6' pattern='[0-9A-Fa-f]{6}' required title='&#1042;&#1074;&#1077;&#1076;&#1080;&#1090;&#1077; 6 HEX-&#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1086;&#1074;: 0-9 &#1080; A-F' placeholder='000000' autocomplete='off' spellcheck='false' value='");
    html += blockAddr3;
    html += F("'></td></tr>");
    html += F("<tr><th>&#1059;&#1088;&#1086;&#1074;&#1077;&#1085;&#1100; &#1087;&#1086;&#1088;&#1086;&#1075;&#1072; &#1091;&#1089;&#1080;&#1083;&#1080;&#1090;&#1077;&#1083;&#1103; 1090&#1084;&#1043;&#1094; (mV)</th><td><input class='hardwareCtl60' type='number' name='threshold_level' min='0' max='4095' value='");
    html += String(settings ? settings->threshold_level : 910);
    html += F("'></td></tr>");
    html += blockAddrInputFilterScript("block_addr");
    html += blockAddrInputFilterScript("block_addr2");
    html += blockAddrInputFilterScript("block_addr3");
    html += F("</table></div><div class='btnRowEqual'><button class='btn' type='submit'><span class='btnIcon'>&#128190;</span>&#1057;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100; &#1080; &#1086;&#1073;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100;</button><a class='btn' href='/'><span class='btnIcon'>&#8634;</span>&#1042;&#1086;&#1079;&#1074;&#1088;&#1072;&#1090; &#1073;&#1077;&#1079; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103;</a></div></form>");
    html += F("</div></body></html>");

    return html;
}

//------------------------------------------------------------------------------
// Назначение функции: Выполняет логику функции `hardwareSavedPage` и обрабатывает hardware saved страницу в контексте модуля WebRF.cpp.
// Локальные переменные: html — текстовая строка или буфер: хранит входное сообщение, сформированный ответ либо промежуточный текст.
//------------------------------------------------------------------------------
static String hardwareSavedPage(bool defaultsLoaded)
{
    String html = htmlBegin("&#1053;&#1086;&#1074;&#1099;&#1077; &#1072;&#1087;&#1087;&#1072;&#1088;&#1072;&#1090;&#1085;&#1099;&#1077; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080;");
    html += F("<h1>&#1053;&#1086;&#1074;&#1099;&#1077; &#1072;&#1087;&#1087;&#1072;&#1088;&#1072;&#1090;&#1085;&#1099;&#1077; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080;:</h1><table>");
    html += F("<tr><th>&#1044;&#1072;&#1085;&#1085;&#1099;&#1077; LoRa &#1085;&#1072; TFT</th><td>"); html += yesNo(settings ? settings->rssi_view : 0, "&#1042;&#1099;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;", "&#1042;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;"); html += F("</td></tr>");
    html += F("<tr><th>&#1056;&#1077;&#1078;&#1080;&#1084; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1076;&#1080;&#1089;&#1087;&#1083;&#1077;&#1103;</th><td>"); html += displayModeName(settings ? settings->display_set : INFO_DISTLAY_OFF); html += F("</td></tr>");
    html += F("<tr><th>LoRa mode</th><td>"); html += loraFixedModeName(settings ? settings->lora_fixed_channel : 1); html += F("</td></tr>");
    html += F("<tr><th>LoRa freq</th><td>"); html += loraFixedFreqName(settings ? settings->lora_fixed_freq : 0); html += F("</td></tr>");
    html += F("<tr><th>RF protocol</th><td>"); html += rfProtocolName(settings ? settings->rf_protocol : RF_PROTOCOL_OGNTP); html += F("</td></tr>");
    html += F("<tr><th>LoRa profile</th><td>"); html += RF_GetProfileName((settings && settings->rf_protocol == RF_PROTOCOL_MAVLINK) ? RF_GetAutoLoRaProfile(RF_PROTOCOL_MAVLINK) : (settings ? settings->lora_profile : 0)); html += F("</td></tr>");
    html += F("<tr><th>LoRa TX power (&#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1072;)</th><td>"); html += String(settings ? settings->txpower : 20); html += F(" dBm</td></tr>");
    html += F("<tr><th>&#1054;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1090;&#1100; GPS &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1085;&#1072; TFT</th><td>"); html += yesNo(settings ? settings->lan_state_view : 0, "&#1042;&#1099;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100;", "&#1042;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100;"); html += F("</td></tr>");
    html += F("<tr><th>&#1054;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1083;&#1086;&#1082;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;</th><td>"); html += yesNo(settings ? settings->view_test_coord : 0, "&#1042;&#1099;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100;", "&#1042;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100;"); html += F("</td></tr>");
    html += F("<tr><th>&#1044;&#1080;&#1072;&#1087;&#1072;&#1079;&#1086;&#1085; &#1087;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1072; TFT</th><td>"); html += radarRangeModeName(settings ? settings->radar_range_mode : 0); html += F("</td></tr>");
    html += F("<tr><th>&#1058;&#1088;&#1077;&#1074;&#1086;&#1075;&#1072; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077; (m)</th><td>"); html += String(settings ? settings->alarm_attention : 3000); html += F("</td></tr>");
    html += F("<tr><th>&#1058;&#1088;&#1077;&#1074;&#1086;&#1075;&#1072; &#1087;&#1088;&#1077;&#1076;&#1091;&#1087;&#1088;&#1077;&#1078;&#1076;&#1077;&#1085;&#1080;&#1077; (m)</th><td>"); html += String(settings ? settings->alarm_warning : 2000); html += F("</td></tr>");
    html += F("<tr><th>&#1058;&#1088;&#1077;&#1074;&#1086;&#1075;&#1072; &#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1100; (m)</th><td>"); html += String(settings ? settings->alarm_danger : 500); html += F("</td></tr>");
    html += F("<tr><th>&#1058;&#1088;&#1077;&#1074;&#1086;&#1075;&#1072; &#1074;&#1099;&#1089;&#1086;&#1090;&#1072; (m)</th><td>"); html += String(settings ? settings->alarm_height : 300); html += F("</td></tr>");
    html += F("<tr><th>&#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;</th><td>"); html += (defaultsLoaded ? "&#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1086;" : "&#1053;&#1077; &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1090;&#1100;"); html += F("</td></tr>");
    html += F("<tr><th>&#1041;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072;</th><td>"); html += blockAddrSummary(); html += F("</td></tr>");
    html += F("<tr><th>&#1059;&#1088;&#1086;&#1074;&#1077;&#1085;&#1100; &#1087;&#1086;&#1088;&#1086;&#1075;&#1072; &#1091;&#1089;&#1080;&#1083;&#1080;&#1090;&#1077;&#1083;&#1103; 1090&#1084;&#1043;&#1094; (mV)</th><td>"); html += String(settings ? settings->threshold_level : 910); html += F("</td></tr>");
    html += F("<tr><th>&#1040;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1081; AP IP</th><td>"); html += WiFi_apIP().toString(); html += F("</td></tr>");
    html += F("</table>");
    html += loraRuntimeSettingsBlock("&#1056;&#1077;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; LoRa / LMIC");
    html += F("<div class='hr'></div><div class='confirmTitle'>&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1099; &#1073;&#1077;&#1079; &#1087;&#1077;&#1088;&#1077;&#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1080;.</div><div class='btnRow'><a class='btn' href='/'><span class='btnIcon'>&#127968;</span>&#1053;&#1072; &#1075;&#1083;&#1072;&#1074;&#1085;&#1091;&#1102;</a></div></div></body></html>");
    return html;
}

