MoseychukA/FLARM_ALL/ChatGPT_FlyRF/ESP32_Base/FlyRf_Base_26_04_22_12/WebRF.cpp
    if (server.hasArg("tracker_send")) settings->tracker_send = (uint8_t)clampInt(server.arg("tracker_send").toInt(), 0, 15);
    if (server.hasArg("mode")) settings->mode = (uint8_t)clampInt(server.arg("mode").toInt(), FLYRF_MODE_NORMAL, FLYRF_MODE_TXRX_TEST_MAX);
    if (server.hasArg("input_N_S")) settings->input_N_S = (uint8_t)clampInt(server.arg("input_N_S").toInt(), 0, 1);
    if (server.hasArg("local_latitude")) settings->local_latitude = server.arg("local_latitude").toFloat();
    if (server.hasArg("input_E_W")) settings->input_E_W = (uint8_t)clampInt(server.arg("input_E_W").toInt(), 0, 1);
    if (server.hasArg("local_longitude")) settings->local_longitude = server.arg("local_longitude").toFloat();
    applyRuntimeLocalCoordinates();
    EEPROM_store();

    sendNoCache();
    server.send(200, "application/json; charset=utf-8", "{\"ok\":true}");
}

//------------------------------------------------------------------------------
// Назначение функции: Обрабатывает hardware live: принимает событие, выбирает нужную ветку логики и запускает действия модуля.
// Локальные переменные: resetDefaults — рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла.
// - parsedBlockAddr: Параметр конфигурации интерфейса, адресации или выбранного режима.
// - normalizedBlockAddr: Параметр конфигурации интерфейса, адресации или выбранного режима.
// - normalizedBlockAddr2: Параметр конфигурации интерфейса, адресации или выбранного режима.
// - normalizedBlockAddr3: Параметр конфигурации интерфейса, адресации или выбранного режима.
// - blockAddrError: Параметр конфигурации интерфейса, адресации или выбранного режима.
//------------------------------------------------------------------------------
static void handleHardwareLive()
{
    if (!settings)
    {
        sendNoCache();
        server.send(500, "application/json; charset=utf-8", "{\"ok\":false,\"message\":\"settings not ready\"}");
        return;
    }

    bool resetDefaults = false;  //
    if (server.hasArg("default_settings") && server.arg("default_settings").toInt() == 1)
    {
        EEPROM_clear();
        resetDefaults = true;
    }
    else
    {
        if (server.hasArg("rssi_view")) settings->rssi_view = (uint8_t)clampInt(server.arg("rssi_view").toInt(), 0, 1);
        if (server.hasArg("display_set")) settings->display_set = (uint8_t)clampInt(server.arg("display_set").toInt(), INFO_DISTLAY_OFF, INFO_DISPLAY_LORA_RAW);
        settings->tft_memory_view = 0;
        if (server.hasArg("serial_out")) settings->serial_out = (uint8_t)clampInt(server.arg("serial_out").toInt(), OUTPUT_MODE_OFF, OUTPUT_MODE_MAVLINK);
        if (server.hasArg("rs485_out")) settings->rs485_out = (uint8_t)clampInt(server.arg("rs485_out").toInt(), OUTPUT_MODE_OFF, OUTPUT_MODE_MAVLINK);
        if (server.hasArg("bluetooth")) settings->bluetooth = (uint8_t)clampInt(server.arg("bluetooth").toInt(), BLUETOOTH_OFF, BLUETOOTH_LE);
        if (server.hasArg("view_gps_data")) settings->lan_state_view = (uint8_t)clampInt(server.arg("view_gps_data").toInt(), 0, 1);
        if (server.hasArg("rf_protocol")) settings->rf_protocol = parseRfProtocolArg(server.arg("rf_protocol"));
        settings->band = RF_BAND_RU;
        settings->lora_fixed_channel = 1;
        settings->lora_fixed_freq = 8;
        if (server.hasArg("lora_profile")) settings->lora_profile = (uint8_t)clampInt(server.arg("lora_profile").toInt(), 0, 3);
        settings->txpower = 20;
                if (server.hasArg("view_test_coord")) settings->view_test_coord = (uint8_t)clampInt(server.arg("view_test_coord").toInt(), 0, 1);
        if (server.hasArg("radar_range_mode")) settings->radar_range_mode = (uint8_t)clampInt(server.arg("radar_range_mode").toInt(), 0, 1);
        uint32_t parsedBlockAddr[3] = {0U, 0U, 0U};
        String normalizedBlockAddr;
        String normalizedBlockAddr2;
        String normalizedBlockAddr3;
        String blockAddrError;
        if (!readBlockAddrArg("block_addr", parsedBlockAddr[0], normalizedBlockAddr, blockAddrError) ||
            !readBlockAddrArg("block_addr2", parsedBlockAddr[1], normalizedBlockAddr2, blockAddrError) ||
            !readBlockAddrArg("block_addr3", parsedBlockAddr[2], normalizedBlockAddr3, blockAddrError))
        {
            sendNoCache();
            String json = F("{\"ok\":false,\"message\":\"");
            json += blockAddrError;
            json += F("\"}");
            server.send(400, "application/json; charset=utf-8", json);
            return;
        }
        for (size_t i = 0; i < 3; ++i)
        {
            settings->block_addr[i] = parsedBlockAddr[i];
        }
        if (server.hasArg("threshold_level")) settings->threshold_level = (int16_t)clampInt(server.arg("threshold_level").toInt(), 0, 4095);
        if (server.hasArg("alarm_attention")) settings->alarm_attention = (int16_t)clampAlarmAttention(server.arg("alarm_attention").toInt());
        if (server.hasArg("alarm_warning")) settings->alarm_warning = (int16_t)clampAlarmWarning(server.arg("alarm_warning").toInt());
        if (server.hasArg("alarm_danger")) settings->alarm_danger = (int16_t)clampAlarmDanger(server.arg("alarm_danger").toInt());
        if (server.hasArg("alarm_height")) settings->alarm_height = (int16_t)clampAlarmHeight(server.arg("alarm_height").toInt());
        if (settings->alarm_warning > settings->alarm_attention) settings->alarm_warning = settings->alarm_attention;
        if (settings->alarm_danger > settings->alarm_warning) settings->alarm_danger = settings->alarm_warning;
        EEPROM_store();
        RF_NotifySettingsChanged();
    }
    if (resetDefaults) RF_NotifySettingsChanged();
    RP2040Bridge_sendGainNow();

    String json = F("{\"ok\":true,\"reset_defaults\":");
    json += resetDefaults ? F("true") : F("false");
    json += F("}");
    sendNoCache();
    server.send(200, "application/json; charset=utf-8", json);
}

//------------------------------------------------------------------------------
// Назначение функции: Обрабатывает outputs live: принимает событие, выбирает нужную ветку логики и запускает действия модуля.
//------------------------------------------------------------------------------
static void handleOutputsLive()
{
    if (!settings)
    {
        sendNoCache();
        server.send(500, "application/json; charset=utf-8", "{\"ok\":false,\"message\":\"settings not ready\"}");
        return;
    }

    if (server.hasArg("serial_out")) settings->serial_out = (uint8_t)clampInt(server.arg("serial_out").toInt(), OUTPUT_MODE_OFF, OUTPUT_MODE_MAVLINK);
    if (server.hasArg("rs485_out")) settings->rs485_out = (uint8_t)clampInt(server.arg("rs485_out").toInt(), OUTPUT_MODE_OFF, OUTPUT_MODE_MAVLINK);
    if (server.hasArg("bluetooth")) settings->bluetooth = (uint8_t)clampInt(server.arg("bluetooth").toInt(), BLUETOOTH_OFF, BLUETOOTH_LE);
    if (server.hasArg("nmea_out")) settings->nmea_out = (uint8_t)clampInt(server.arg("nmea_out").toInt(), NMEA_OUTPUT_OFF, NMEA_OUTPUT_BLUETOOTH);
    if (server.hasArg("udp_port")) settings->udp_port = (uint16_t)clampInt(server.arg("udp_port").toInt(), 1, 65535);
    if (settings->udp_port == 0) settings->udp_port = WiFi_defaultNmeaUdpPort();
    EEPROM_store();

    sendNoCache();
    server.send(200, "application/json; charset=utf-8", "{\"ok\":true}");
}

//------------------------------------------------------------------------------
// Назначение функции: Обрабатывает hardware input: принимает событие, выбирает нужную ветку логики и запускает действия модуля.
// Локальные переменные: defaultsLoaded — рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла.
// - parsedBlockAddr: Параметр конфигурации интерфейса, адресации или выбранного режима.
// - normalizedBlockAddr: Параметр конфигурации интерфейса, адресации или выбранного режима.
// - normalizedBlockAddr2: Параметр конфигурации интерфейса, адресации или выбранного режима.
// - normalizedBlockAddr3: Параметр конфигурации интерфейса, адресации или выбранного режима.
// - blockAddrError: Параметр конфигурации интерфейса, адресации или выбранного режима.
//------------------------------------------------------------------------------
static void handleHardwareInput()
{
    bool defaultsLoaded = false;  //
    if (settings)
    {
        if (server.hasArg("default_settings") && server.arg("default_settings").toInt() == 1)
        {
            EEPROM_clear();
            defaultsLoaded = true;
        }
        else
        {
            if (server.hasArg("rssi_view")) settings->rssi_view = (uint8_t)clampInt(server.arg("rssi_view").toInt(), 0, 1);
            if (server.hasArg("display_set")) settings->display_set = (uint8_t)clampInt(server.arg("display_set").toInt(), INFO_DISTLAY_OFF, INFO_DISPLAY_LORA_RAW);
            settings->tft_memory_view = 0;
            if (server.hasArg("serial_out")) settings->serial_out = (uint8_t)clampInt(server.arg("serial_out").toInt(), OUTPUT_MODE_OFF, OUTPUT_MODE_MAVLINK);
            if (server.hasArg("rs485_out")) settings->rs485_out = (uint8_t)clampInt(server.arg("rs485_out").toInt(), OUTPUT_MODE_OFF, OUTPUT_MODE_MAVLINK);
        if (server.hasArg("bluetooth")) settings->bluetooth = (uint8_t)clampInt(server.arg("bluetooth").toInt(), BLUETOOTH_OFF, BLUETOOTH_LE);
            if (server.hasArg("view_gps_data")) settings->lan_state_view = (uint8_t)clampInt(server.arg("view_gps_data").toInt(), 0, 1);
            if (server.hasArg("rf_protocol")) settings->rf_protocol = parseRfProtocolArg(server.arg("rf_protocol"));
            settings->band = RF_BAND_RU;
            settings->lora_fixed_channel = 1;
            settings->lora_fixed_freq = 8;
            if (server.hasArg("lora_profile")) settings->lora_profile = (uint8_t)clampInt(server.arg("lora_profile").toInt(), 0, 3);
                if (server.hasArg("view_test_coord")) settings->view_test_coord = (uint8_t)clampInt(server.arg("view_test_coord").toInt(), 0, 1);
            if (server.hasArg("radar_range_mode")) settings->radar_range_mode = (uint8_t)clampInt(server.arg("radar_range_mode").toInt(), 0, 1);
            uint32_t parsedBlockAddr[3] = {0U, 0U, 0U};
            String normalizedBlockAddr;
            String normalizedBlockAddr2;
            String normalizedBlockAddr3;
            String blockAddrError;
            if (!readBlockAddrArg("block_addr", parsedBlockAddr[0], normalizedBlockAddr, blockAddrError) ||
                !readBlockAddrArg("block_addr2", parsedBlockAddr[1], normalizedBlockAddr2, blockAddrError) ||
                !readBlockAddrArg("block_addr3", parsedBlockAddr[2], normalizedBlockAddr3, blockAddrError))
            {
                sendValidationErrorPage(F("&#1054;&#1096;&#1080;&#1073;&#1082;&#1072; &#1074;&#1074;&#1086;&#1076;&#1072;"), blockAddrError);
                return;
            }
            for (size_t i = 0; i < 3; ++i)
            {
                settings->block_addr[i] = parsedBlockAddr[i];
            }
            if (server.hasArg("threshold_level")) settings->threshold_level = (int16_t)clampInt(server.arg("threshold_level").toInt(), 0, 4095);
            if (server.hasArg("alarm_attention")) settings->alarm_attention = (int16_t)clampAlarmAttention(server.arg("alarm_attention").toInt());
            if (server.hasArg("alarm_warning")) settings->alarm_warning = (int16_t)clampAlarmWarning(server.arg("alarm_warning").toInt());
            if (server.hasArg("alarm_danger")) settings->alarm_danger = (int16_t)clampAlarmDanger(server.arg("alarm_danger").toInt());
            if (server.hasArg("alarm_height")) settings->alarm_height = (int16_t)clampAlarmHeight(server.arg("alarm_height").toInt());
            if (settings->alarm_warning > settings->alarm_attention) settings->alarm_warning = settings->alarm_attention;
            if (settings->alarm_danger > settings->alarm_warning) settings->alarm_danger = settings->alarm_warning;
            EEPROM_store();
        RF_NotifySettingsChanged();
        }
        if (defaultsLoaded) RF_NotifySettingsChanged();
        RP2040Bridge_sendGainNow();
    }
    sendPage(hardwareSavedPage(defaultsLoaded));
}

//------------------------------------------------------------------------------
// Назначение функции: Обрабатывает outputs: принимает событие, выбирает нужную ветку логики и запускает действия модуля.
//------------------------------------------------------------------------------
static void handleOutputsSave()
{
    if (settings)
    {
        if (server.hasArg("serial_out")) settings->serial_out = (uint8_t)clampInt(server.arg("serial_out").toInt(), OUTPUT_MODE_OFF, OUTPUT_MODE_MAVLINK);
        if (server.hasArg("rs485_out")) settings->rs485_out = (uint8_t)clampInt(server.arg("rs485_out").toInt(), OUTPUT_MODE_OFF, OUTPUT_MODE_MAVLINK);
        if (server.hasArg("bluetooth")) settings->bluetooth = (uint8_t)clampInt(server.arg("bluetooth").toInt(), BLUETOOTH_OFF, BLUETOOTH_LE);
        if (server.hasArg("nmea_out")) settings->nmea_out = (uint8_t)clampInt(server.arg("nmea_out").toInt(), NMEA_OUTPUT_OFF, NMEA_OUTPUT_BLUETOOTH);
        if (server.hasArg("udp_port")) settings->udp_port = (uint16_t)clampInt(server.arg("udp_port").toInt(), 1, 65535);
        if (settings->udp_port == 0) settings->udp_port = WiFi_defaultNmeaUdpPort();
        EEPROM_store();
    }
    sendPage(outputsSavedPage());
}

//------------------------------------------------------------------------------
// Назначение функции: Обрабатывает пакет counters: принимает событие, выбирает нужную ветку логики и запускает действия модуля.
//------------------------------------------------------------------------------
static void handlePacketCounters()
{
    uint32_t txPackets = 0;  //
    uint32_t rxPackets = 0;  //
    RF_GetPacketCounters(txPackets, rxPackets);

    String json = F("{\"tx\":");
    json += String(txPackets);
    json += F(",\"rx\":");
    json += String(rxPackets);
    json += F(",\"utc_text\":\"");
    json += jsonEscape(formatUtcNowText());
    json += F("\",\"satellites\":");
    json += String(GNSS_satellitesValid() ? GNSS_satellites() : 0);
    json += F(",\"coords_text\":\"");
    json += jsonEscape(formatGnssCoordinateText());
    json += F("\",\"gps_altitude_text\":\"");
    json += jsonEscape(formatGpsAltitudeText());
    json += F("\",\"altitude_text\":\"");
    json += jsonEscape(formatAltitudeText());
    json += F("\"}");
    sendNoCache();
    server.send(200, "application/json; charset=utf-8", json);
}

//------------------------------------------------------------------------------
// Назначение функции: Обрабатывает OTA-обновление status: принимает событие, выбирает нужную ветку логики и запускает действия модуля.
//------------------------------------------------------------------------------
static void handleOtaStatus()
{
    String json = F("{\"in_progress\":");
    json += g_otaInProgress ? F("true") : F("false");
    json += F(",\"written\":");
    json += String(g_otaWritten);
    json += F(",\"total\":");
    json += String(g_otaTotal);
    json += F(",\"ok\":");
    json += g_updateOk ? F("true") : F("false");
    json += F(",\"message\":\"");
    String msg = g_updateMessage;  
    msg.replace("\\", "\\\\");
    msg.replace("\"", "\\\"");
    msg.replace("\r", " ");
    msg.replace("\n", " ");
    json += msg;
    json += F("\"}");
    sendNoCache();
    server.send(200, "application/json; charset=utf-8", json);
}

//------------------------------------------------------------------------------
// Назначение функции: Обрабатывает finished: принимает событие, выбирает нужную ветку логики и запускает действия модуля.
//------------------------------------------------------------------------------
static void handleUpdateFinished()
{
    sendNoCache();
    server.send(200, "text/plain; charset=utf-8", (Update.hasError() || !g_updateOk) ? "FAIL" : "OK");
    if (!Update.hasError() && g_updateOk)
    {
        scheduleReboot(4000);
    }
}

//------------------------------------------------------------------------------
// Назначение функции: Обрабатывает upload: принимает событие, выбирает нужную ветку логики и запускает действия модуля.
// Локальные переменные: upload — рабочая переменная модуля: хранит промежуточное значение, используемое в текущей логике файла.
//------------------------------------------------------------------------------
static void handleUpdateUpload()
{
    HTTPUpload& upload = server.upload();

