MoseychukA/FLARM_ALL/ChatGPT_FlyRF/ESP32_Base/FlyRf_Base_26_04_22_12/WebRF.cpp
    if (upload.status == UPLOAD_FILE_START)
    {
        Serial.printf("[OTA] START filename=%s\n", upload.filename.c_str());
        g_updateOk = false;
        g_updateMessage = F("&#1048;&#1076;&#1105;&#1090; &#1087;&#1086;&#1076;&#1075;&#1086;&#1090;&#1086;&#1074;&#1082;&#1072; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;...");
        g_otaInProgress = true;
        g_otaWritten = 0;
        g_otaTotal = upload.totalSize;

        uint32_t maxSketchSpace = ((ESP.getFreeSketchSpace() - 0x1000) & 0xFFFFF000);
        if (!Update.begin(maxSketchSpace))
        {
            g_updateMessage = F("&#1053;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1085;&#1072;&#1095;&#1072;&#1090;&#1100; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;");
            Update.printError(Serial);
        }
    }
    else if (upload.status == UPLOAD_FILE_WRITE)
    {
        if (Update.write(upload.buf, upload.currentSize) != upload.currentSize)
        {
            g_updateMessage = F("&#1054;&#1096;&#1080;&#1073;&#1082;&#1072; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; &#1087;&#1088;&#1086;&#1096;&#1080;&#1074;&#1082;&#1080;");
            g_updateOk = false;
            g_otaInProgress = false;
            Update.printError(Serial);
        }
        else
        {
            g_otaWritten += upload.currentSize;
            g_updateMessage = F("&#1055;&#1077;&#1088;&#1077;&#1076;&#1072;&#1095;&#1072; &#1092;&#1072;&#1081;&#1083;&#1072; &#1085;&#1072; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086;...");
            if ((g_otaWritten % 65536U) < (uint32_t)upload.currentSize)
                Serial.printf("[OTA] WRITTEN=%u/%u\n", (unsigned)g_otaWritten, (unsigned)g_otaTotal);
        }
    }
    else if (upload.status == UPLOAD_FILE_END)
    {
        g_otaInProgress = false;
        Serial.printf("[OTA] END written=%u total=%u\n", (unsigned)g_otaWritten, (unsigned)g_otaTotal);
        if (Update.end(true))
        {
            g_updateOk = true;
            g_otaWritten = g_otaTotal;
            g_updateMessage = F("&#1054;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1086;. &#1055;&#1077;&#1088;&#1077;&#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1072;...");
            Serial.printf("[OTA] SUCCESS size=%u\n", (unsigned)upload.totalSize);
        }
        else
        {
            g_updateOk = false;
            g_updateMessage = F("&#1054;&#1096;&#1080;&#1073;&#1082;&#1072; &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1080;&#1103; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;");
            Update.printError(Serial);
        }
    }
    else if (upload.status == UPLOAD_FILE_ABORTED)
    {
        g_otaInProgress = false;
        g_updateOk = false;
        g_updateMessage = F("&#1047;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1072; &#1086;&#1090;&#1084;&#1077;&#1085;&#1077;&#1085;&#1072;");
        Serial.println("[OTA] ABORT");
        Update.abort();
    }
    yield();
}

//------------------------------------------------------------------------------
// Назначение функции: Обрабатывает not found: принимает событие, выбирает нужную ветку логики и запускает действия модуля.
//------------------------------------------------------------------------------
static void handleNotFound()
{
    server.send(404, "text/plain; charset=utf-8", "File Not Found");
}

//------------------------------------------------------------------------------
// Назначение функции: Инициализирует web, подготавливает связанные объекты и включает работу соответствующего узла.
//------------------------------------------------------------------------------
void Web_setup()
{
    server.on("/", handleRoot);
    server.on("/settings", handleSettings);
    server.on("/input", handleInput);
    server.on("/hardware_settings", handleHardwareSettings);
    server.on("/hardware_input", handleHardwareInput);
    server.on("/outputs", handleOutputs);
    server.on("/outputs_save", handleOutputsSave);
    server.on("/monitor", handleMonitor);
    server.on("/aircraft.json", handleAircraftJson);
    server.on("/packet_counters", handlePacketCounters);
    server.on("/about", handleAbout);
    server.on("/firmware", handleFirmware);
    server.on("/update", HTTP_POST, handleUpdateFinished, handleUpdateUpload);
    server.on("/ota_status", handleOtaStatus);
    server.onNotFound(handleNotFound);
    server.begin();
}

//------------------------------------------------------------------------------
// Назначение функции: Обслуживает web в основном цикле: проверяет события, обновляет состояние и запускает нужные действия.
//------------------------------------------------------------------------------
void Web_loop()
{
    server.handleClient();
    if (g_rebootPending && (int32_t)(millis() - g_rebootAtMs) >= 0)
    {
        g_rebootPending = false;
        ESP.restart();
    }
}

//------------------------------------------------------------------------------
// Назначение функции: Выполняет логику функции `Web_fini` и обрабатывает web fini в контексте модуля WebRF.cpp.
//------------------------------------------------------------------------------
void Web_fini()
{
    server.stop();
}
